docs/finance/EventStudy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-11 Wed 10:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../styles/readtheorg/css/rtd-full.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Event Study</a></li>
<li><a href="#orgheadline2">2. Events</a></li>
<li><a href="#orgheadline3">3. Study Definition</a></li>
<li><a href="#orgheadline6">4. Normal Return Models</a>
<ul>
<li><a href="#orgheadline4">4.1. Interaction factor</a></li>
<li><a href="#orgheadline5">4.2. Output</a></li>
</ul>
</li>
<li><a href="#orgheadline7">5. Non-parametric Significance Test</a></li>
<li><a href="#orgheadline8">6. 1</a></li>
<li><a href="#orgheadline9">7. 1</a></li>
<li><a href="#orgheadline10">8. 1</a></li>
<li><a href="#orgheadline11">9. 1</a></li>
<li><a href="#orgheadline12">10. 1</a></li>
<li><a href="#orgheadline13">11. 1</a></li>
<li><a href="#orgheadline14">12. 1</a></li>
<li><a href="#orgheadline15">13. 1</a></li>
<li><a href="#orgheadline16">14. 1</a></li>
<li><a href="#orgheadline17">15. 1</a></li>
<li><a href="#orgheadline18">16. 1</a></li>
<li><a href="#orgheadline19">17. 1</a></li>
<li><a href="#orgheadline20">18. 1</a></li>
<li><a href="#orgheadline21">19. 1</a></li>
<li><a href="#orgheadline22">20. 1</a></li>
<li><a href="#orgheadline23">21. 1</a></li>
<li><a href="#orgheadline24">22. 1</a></li>
<li><a href="#orgheadline25">23. 1</a></li>
<li><a href="#orgheadline26">24. 1</a></li>
<li><a href="#orgheadline27">25. 1</a></li>
<li><a href="#orgheadline28">26. 1</a></li>
<li><a href="#orgheadline29">27. 1</a></li>
<li><a href="#orgheadline30">28. 1</a></li>
<li><a href="#orgheadline31">29. 1</a></li>
<li><a href="#orgheadline32">30. 1</a></li>
<li><a href="#orgheadline33">31. 1</a></li>
<li><a href="#orgheadline34">32. 1</a></li>
<li><a href="#orgheadline35">33. 1</a></li>
<li><a href="#orgheadline36">34. 1</a></li>
<li><a href="#orgheadline37">35. 1</a></li>
<li><a href="#orgheadline38">36. 1</a></li>
<li><a href="#orgheadline39">37. 1</a></li>
<li><a href="#orgheadline40">38. 1</a></li>
<li><a href="#orgheadline41">39. 1</a></li>
<li><a href="#orgheadline42">40. 1</a></li>
<li><a href="#orgheadline43">41. 1</a></li>
<li><a href="#orgheadline44">42. 1</a></li>
<li><a href="#orgheadline45">43. 1</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Event Study</h2>
<div class="outline-text-2" id="text-1">
<p>
The Event Study module is designed to evaluate the impact of discrete events on future returns. Classic examples of these events are stock splits, earnings surprises, index additions and deletions. The event study attempts to determine if there is a significant abnormal return which can be attributed to the occurrence of the event.
Table of contents [hide]
1 Event Definition
2 Study Definition
2.1 Normal Return Models
2.1.1 Normal Return Model calculation
2.2 Interaction factor
3 Output
3.1 Non-parametric Significance Test
Event Definition
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Events</h2>
<div class="outline-text-2" id="text-2">
<p>
can be defined using ClariFI's visual query language. Any combination of fundamental, macroeconomic, or market data can be combined to create global or issue-specific values which can then be used to define event rules in the study definition. Any size universe can be studied, and historical analysis is limited only by the data available. Additionally, raw data sources representing events, such as elementized news feeds, can be used.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Study Definition</h2>
<div class="outline-text-2" id="text-3">
<p>
Event Studies are defined by the creation of Rules which compare expressions to each other, or to constants. For example, an earnings surprise expression can be compared to a threshold value, in percentage or dollar terms, to create a "Positive Earning Surprise" event. This event will be defined to occur for an issue when that issue's earnings surprise expression value exceeds the threshold. Arbitrarily complex events can be defined in this way.
Next, the Event Window is defined. This is the number of business days before and after the event day over which the return is to be analyzed. The return during the period before the event can give an indication of whether there is information leakage prior to the event being publicly available. The return after the event window is analyzed for the effect that the general knowledge of the event has on the issue's return.
Event Timeline
Enlarge
Event Timeline
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">4</span> Normal Return Models</h2>
<div class="outline-text-2" id="text-4">
<p>
Event Studies depend on the definition of abnormal return, that is, the return that is attributed to the occurrence of the event, to differentiate it from the normal return that would have occurred otherwise. Since the normal return is unobservable (we cannot know what the return would have been in the absence of the event), normal return models are used to isolate the event's effect.
Typical normal return models include the "Constant Mean" model, where the issue's return is averaged over a given window prior to the event window, and this mean return is used as a constant to offset the actual return of the issue during the event window. This will essentially de-trend the return series so the event's effects can be isolated. Another typical model is the Market Model, which estimates the issue's alpha, &alpha;<sub>i</sub>, and beta, &beta;<sub>i</sub>, over a window prior to the event window (T<sub>0</sub>, T<sub>1</sub>]. The alpha and beta are estimated relative to a market return series r<sub>M</sub> given by the user, and the normal return, \hat{r}<sub>i</sub>, is then given by
\hat{r}<sub>i</sub> = &alpha;<sub>i</sub> + &beta;<sub>i</sub> r<sub>M</sub>.
These models, in addition to the ability to define issues' normal returns using ClariFI's expression language, can be used in the Event Study module to define the normal returns which will be used in the analysis.
Normal Return Model calculation
Therefore, to properly calculate the abnormal returns for an event, the event study must be able to load and have available all of the returns data for the issue that has the event over the dates in the event study (see the event timeline to the right). This means that if the issue is removed from the basket over the calculation time period, then the event cannot be calculated and it will be considered a failed event.
If a lot of events fail due to missing returns data, then the basket used in the event study could be flattened to a single view basket whereby the union of all issues are present for the entire life of the basket, starting at the epoch.
For example, assume the normal return model is set to Market with a window size of 40. Further assume we want to examine an event window of 5 days before and 20 days after the event. This means that returns data must be available for a total of 45 days (market return window size + number of days before the event) before the actual event date. If the vendor pricing data has any missing values on any of those dates, or if the issue itself is not present in the basket on one of those dates, then the normal return cannot be computed and the event is added to the list of failed events.
</p>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">4.1</span> Interaction factor</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Additionally, the user can specify one or more Interaction Factors. This interaction factor is a discrete value that can be assigned to each security for the purposes of grouping. These values can come from Security Master fields such as Sector, Industry, or Country, or from ClariFI's visual query language to denote such things as market capitalization decile. Abnormal returns can be further broken down by the groups defined by these interaction factors. That is, one can analyze abnormal returns just among those issues in the Consumer Discretionary sector, or the 3rd book-to-price quintile.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">4.2</span> Output</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The primary measure of the event's impact on returns is the Cumulative Abnormal Return, or CAR. For issue i, for each day &tau; of the event window (T<sub>1</sub>, T<sub>2</sub>], this is the cumulative sum of the abnormal returns (actual return on each day - expected daily return).
\textrm{CAR} = &sum;<sub>t=T<sub>1</sub></sub>^&tau; (r<sub>i</sub>(t)-\hat{r}<sub>i</sub>(t)).
</p>

<p>
Also of interest is the Standardized Cumulative Abnormal Return, or SCAR, where the &sigma; in the denominator is the biased standard deviation of the abnormal returns.
\textrm{SCAR} = \frac{\textrm{CAR}(T<sub>1,&tau;</sub>)}{&sigma;(T<sub>1</sub>, &tau;)}.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">5</span> Non-parametric Significance Test</h2>
<div class="outline-text-2" id="text-5">
<p>
The Event Study report applies a non-parametric test to find statistical evidence for the presence of abnormal returns. For instance, a statistical measure of the the event's significance is the Sign Test, which is based on the sign of the abnormal return. The null hypothesis is that there are an equal number of positive and negative abnormal returns in the cross-section. To calculate the test statistic, we take the number of cases where the abnormal return is positive, N^+, and the total number of cases, N. Then, the test statistic, J<sub>3</sub> is given by
J<sub>3</sub> = \left[\frac{N^+}{N} - 0.5\right] \frac{N<sup>1/2</sup>}{0.5}&sim; \mathcal{N}(0,1).
We reject the null hypothesis if J<sub>3</sub> &gt; &Phi;<sup>-1</sup>(&alpha;) where (1-&alpha;) is the test size and where &Phi;(.) is the standard normal cumulative distribution function (CDF).
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">6</span> 1</h2>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">7</span> 1</h2>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">8</span> 1</h2>
</div>
<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">9</span> 1</h2>
</div>
<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">10</span> 1</h2>
</div>
<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">11</span> 1</h2>
</div>
<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">12</span> 1</h2>
</div>
<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">13</span> 1</h2>
</div>
<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">14</span> 1</h2>
</div>
<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">15</span> 1</h2>
</div>
<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">16</span> 1</h2>
</div>
<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">17</span> 1</h2>
</div>
<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20"><span class="section-number-2">18</span> 1</h2>
</div>
<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21"><span class="section-number-2">19</span> 1</h2>
</div>
<div id="outline-container-orgheadline22" class="outline-2">
<h2 id="orgheadline22"><span class="section-number-2">20</span> 1</h2>
</div>
<div id="outline-container-orgheadline23" class="outline-2">
<h2 id="orgheadline23"><span class="section-number-2">21</span> 1</h2>
</div>
<div id="outline-container-orgheadline24" class="outline-2">
<h2 id="orgheadline24"><span class="section-number-2">22</span> 1</h2>
</div>
<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25"><span class="section-number-2">23</span> 1</h2>
</div>
<div id="outline-container-orgheadline26" class="outline-2">
<h2 id="orgheadline26"><span class="section-number-2">24</span> 1</h2>
</div>
<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">25</span> 1</h2>
</div>
<div id="outline-container-orgheadline28" class="outline-2">
<h2 id="orgheadline28"><span class="section-number-2">26</span> 1</h2>
</div>
<div id="outline-container-orgheadline29" class="outline-2">
<h2 id="orgheadline29"><span class="section-number-2">27</span> 1</h2>
</div>
<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30"><span class="section-number-2">28</span> 1</h2>
</div>
<div id="outline-container-orgheadline31" class="outline-2">
<h2 id="orgheadline31"><span class="section-number-2">29</span> 1</h2>
</div>
<div id="outline-container-orgheadline32" class="outline-2">
<h2 id="orgheadline32"><span class="section-number-2">30</span> 1</h2>
</div>
<div id="outline-container-orgheadline33" class="outline-2">
<h2 id="orgheadline33"><span class="section-number-2">31</span> 1</h2>
</div>
<div id="outline-container-orgheadline34" class="outline-2">
<h2 id="orgheadline34"><span class="section-number-2">32</span> 1</h2>
</div>
<div id="outline-container-orgheadline35" class="outline-2">
<h2 id="orgheadline35"><span class="section-number-2">33</span> 1</h2>
</div>
<div id="outline-container-orgheadline36" class="outline-2">
<h2 id="orgheadline36"><span class="section-number-2">34</span> 1</h2>
</div>
<div id="outline-container-orgheadline37" class="outline-2">
<h2 id="orgheadline37"><span class="section-number-2">35</span> 1</h2>
</div>
<div id="outline-container-orgheadline38" class="outline-2">
<h2 id="orgheadline38"><span class="section-number-2">36</span> 1</h2>
</div>
<div id="outline-container-orgheadline39" class="outline-2">
<h2 id="orgheadline39"><span class="section-number-2">37</span> 1</h2>
</div>
<div id="outline-container-orgheadline40" class="outline-2">
<h2 id="orgheadline40"><span class="section-number-2">38</span> 1</h2>
</div>
<div id="outline-container-orgheadline41" class="outline-2">
<h2 id="orgheadline41"><span class="section-number-2">39</span> 1</h2>
</div>
<div id="outline-container-orgheadline42" class="outline-2">
<h2 id="orgheadline42"><span class="section-number-2">40</span> 1</h2>
</div>
<div id="outline-container-orgheadline43" class="outline-2">
<h2 id="orgheadline43"><span class="section-number-2">41</span> 1</h2>
</div>
<div id="outline-container-orgheadline44" class="outline-2">
<h2 id="orgheadline44"><span class="section-number-2">42</span> 1</h2>
</div>
<div id="outline-container-orgheadline45" class="outline-2">
<h2 id="orgheadline45"><span class="section-number-2">43</span> 1</h2>
</div>
</div>
</body>
</html>
